{"question_id": 1, "text": "Size verilen cümle çok kelimeli, karmaşık veya belirsiz olabilir. Cümleyi yeniden yazın ve yazınızı daha net hâle getirmek için onu kısa tutun. Mümkün olduğunda, karmaşık cümleleri birden fazla cümleye bölün ve gereksiz kelimeleri çıkarın.\nGirdi: „Ücretim hakkında herhangi bir sorunuz varsa veya bu projenin kapsamını artırmanın veya azaltmanın gerekli olduğunu düşünüyorsanız, lütfen bana bildirin.“, "task": "Self_Instruct", "answer": "Ücretim hakkında herhangi bir sorunuz varsa veya bu projenin kapsamını artırmanın veya azaltmanın gerekli olduğunu düşünüyorsanız, lütfen bana bildirin."},
{"question_id": 2, "text": "Verilen e-postada kelime seçimini, ifadeyi, noktalama işaretlerini ve büyük harf kullanımını analiz edin. Bu e-postanın yazarı okuyucuya nasıl görünebilir? Bu tonlar arasında Cesaret Kırıcı, Suçlayıcı, Endişeli, Meraklı, Şaşırmış, Onaylamayan, Alçakgönüllü, Resmi, İddialı, Kendine Güvenen, Takdir Eden, Endişeli, Üzgün, Resmi Olmayan, Pişman, Teşvik Eden, Bencil, Neşeli, İyimser ve Heyecanlı yer alır.\nGirdi: Merhaba Jen, \n Umarım iyisindir. Bugün görüşebilir miyiz? Yarınki toplantıda yapacağım sunumla ilgili görüşlerini bildirirsen memnun olutum. Özellikle satış rakamlarını benimle birlikte kontrol edersen çok sevinirim. Bu görevde senin için bir kahve var!”, "task": "Self_Instruct", "answer": "Özgüvenli"},
{"question_id": 3, "text": "Verilen metni yeniden yazın ve dilbilgisi, yazım ve noktalama hatalarını düzeltin.\nGirdi: Bana yıl önce bugün bir maraton bitireceğimi söyleseydiniz, gülebilirdim. Desteğinizin üzerimdeki etkisi çok büyük!", "task": "Self_Instruct", "answer": "Eğer bana bir yıl önce bugün bir maratonu bitireceğimi söyleseydiniz, gülerdim. Desteğiniz benim üzerimde büyük bir etki yarattı!"},
{"question_id": 4, "text": "Size bir makale alıntısı verildi, bunu istenen alıntı stiline dönüştürün.\nGirdi: Chicago: Vaswani, Ashish, Shazeer, Noam, Parmar, Niki, Uszkoreit, Jakob, Jones, Llion, Gomez, Aidan N., Kaiser, Lukasz, and Illia Polosukhin. \"Attention Is All You Need.\" arXiv, (2017). https://doi.org/10.48550/arXiv.1706.03762.\nMLA:",
"task": "Self_Instruct", "answer": "Vaswani, Ashish, et al. \"Attention Is All You Need.\" arXiv, 2017, https://doi.org/10.48550/arXiv.1706.03762."},
{"question_id": 5, "text": "Masa başı işler çok fazla e-posta yazmayı gerektirir, bu yüzden kendimizi tekrar etmekten yorulmamız şaşırtıcı değil. Verilen kelimenin birkaç eşanlamlısını bul.", "task": "Self_Instruct", "answer": "Saygılarımla, En iyi dileklerimle, Teşekkürler, Selamlar"},
{"question_id": 6, "text": "Arkadaşlarımı cuma günü yemeğe davet eden bir e-posta yazmama yardımcı olursanız çok memnun olurum.", "task": "Self_Instruct", "answer": "Merhaba,\n\nUmarım iyisinizdir. Cuma akşamı sizi yemeğe davet ediyorum. Katılıp katılamayacağınızı lütfen bana bildirin. Sizin en sevdiğiniz yemekleri pişireceğim!\n\nSizi görmek için sabırsızlanıyorum,"},
{"question_id": 7, "text": "E-postanın tonu değiştirilmeli ve daha profesyonel bir şekilde yeniden yazılmalı.\nGirdi: Konu: Tatil Zamanı Talebi\nMerhaba [İşveren], \nUmarım her şey yolundadır. [Tarih] tarihinde bir gün izin taleb etmek için yazıyorum. O gün için iş sorumluluklarımı zaten yerine getirdim ve sorularınızı yanıtlamak veya endişelerinizi gidermek için hazır olacağım. \n Zaman ayırdığınız için teşekkür ederim, \n[Your name]", "task": "Self_Instruct", "answer": "Konu: İzin Talebi\nMerhaba [İşveren],\nİşten izin almak için yazıyorum. [Tarih] tarihinden itibaren [Gün Sayısı] gün izin almak istiyorum. Tatile çıkmadan önce önce işlerimi tamamladığımdan emin olacağım ve uzakta olduğum sürece e-posta ile ulaşılabilir olacağım. Değerlendirdiğiniz için teşekkür ederim.\n[Adınız]"},

{"question_id": 8, "text": "Bir kitlesel fonlama projesi için iş birliği çağrısı hakkında ikna edici bir sosyal medya gönderisi yazın.", "task": "Self_Instruct", "answer": "Yeni bir kitlesel fonlama projesi için iş birliği arıyoruz! Bu, yenilikçi ve etkileyici bir şeye dahil olmak için harika bir fırsat. Eğer ilgileniyorsanız lütfen bana bildirin."},
{"question_id": 9, "text": "Güç Yüzükleri dizisi hakkında en sevdiğim esprili yorum şudur:", "task": "Self_Instruct", "answer": "Güç Yüzükleri dizisi, yüzükten beri Orta Dünya'dan çıkan en iyi şey! Eğer fantezi, macera ve entrika hayranıysanız, bu dizi tam size göre. Karakterler zengin bir şekilde çizilmiş ve olay örgüsü beklenmedik sürprizlerle dolu. Şiddetle tavsiye ediyorum!"},
{"question_id": 10, "text": "Faydalı bir yazma alıştırması, sıfat veya zarf kullanmadan bir hikaye yazmaktır. Bu, söylemeye çalıştığınız şeyi tanımlamak için başka kelimeleri ve ifadeleri kullanmayı öğrenmenize yardımcı olacaktır. İşte bazı örnekler:", "task": "Self_Instruct", "answer": "Ağaçlar gökyüzüne karşı siluet oluşturmuştu. Rüzgar esiyordu. Yapraklar hışırdıyordu. Çimenler dalgalanıyordu. Çiçekler sallanıyordu. Kuşlar şarkı söylüyordu. Arılar vızıldıyordu. Sincaplar koşuyordu. Tavşanlar zıplıyordu. Geyikler otluyordu. Kurtlar uluyordu. Ay yükseliyordu. Yıldızlar parlıyordu."},
{"question_id": 11, "text": "Google'da kodlama ile ilgili bazı arama sorguları oluşturun.", "task": "Self_Instruct", "answer": "- ikili arama\n- javascript’te pop\n- ses yığınlama algoritması"},
{"question_id": 12, "text": "Arama teriminiz ile en alakalı StackOverflow sorularını keşfedin ve URL'lerini listeleyin.\nGirdi: dizideki ögeyi kaldır", "task": "Self_Instruct", "answer": "1- https://stackoverflow.com/questions/5767325/how-can-i-remove-a-specific-item-from-an-array\n2- https://stackoverflow.com/questions/19544452/remove-last-item-from-array\n3- https://stackoverflow.com/questions/15292278/how-do-i-remove-an-array-item-in-typescript\n4- https://stackoverflow.com/questions/3954438/how-to-remove-item-from-array-by-value\n5- https://stackoverflow.com/questions/40462369/remove-item-from-stored-array-in-angular-2\n6- https://stackoverflow.com/questions/16994212/remove-an-item-from-array-using-underscorejs"},
{"question_id": 13, "text": "Size kodlama hakkında bir algoritma veya bir arama sorgusu verildi. Arama sorgusuyla ilgili bir kod parçacığı arayın\nGirdi: Python döngüsü", "task": "Self_Instruct", "answer": "#Meyve listesindeki her bir meyveyi yazdır:\nmeyveler = [\"elma\", \"muz\", \"kiraz\"]\nx meyveler içindekiler olmak üzere :\n   print(x)"},
{"question_id": 14, "text": "Size kodun bir açıklaması, spesifikasyonları veya istemleri verilir. Geliştirme sürecini hızlandırmak için kod üretimini otomatikleştirmede yardımınıza ihityaç duyulmaktadır.\nGirdi: bir sayının asal olup olmadığını belirleyen python fonksiyonu.", "task": "Self_Instruct", "answer": "def asal_mı(n):\n   if n == 1:\n        return False\n   for i in range(2, int(n**0.5)+1):\n        if n % i == 0:\n             return False\n return True"},
{"question_id": 15, "text": "Bir kodlama sorununda takıldığınızda, yardım almak için bakabileceğiniz en iyi yer belgelerdir. Belgeleri dikkatlice okuyun ve sorununuzu kapsayan bir bölüm olup olmadığına bakın. Çoğu zaman, cevap tam önünüzde olacaktır. Değilse, sorununuzla ilgili anahtar terimleri aramayı deneyin. Verilen arama terimi hakkında faydalı bağlantılar bulun.\nGirdi: sql yinelenen değerleri bul",
"task": "Self_Instruct", "answer": "-  https://iteration-utilities.readthedocs.io/en/latest/generated/duplicates.html\n- https://orange3-text.readthedocs.io/en/latest/widgets/duplicatedetection.html\n- https://beets.readthedocs.io/en/v1.3.14/plugins/duplicates.html\n- https://doma.readthedocs.io/en/latest/sql/\n- https://koalas.readthedocs.io/en/latest/reference/api/databricks.koalas.DataFrame.drop_duplicates.html\n- https://sqlparse.readthedocs.io/en/latest/analyzing/"},
{"question_id": 16, "text": "Aşağıdaki tabloya ev ihtiyaçları bütçesini girdik. Verilen fonksiyonla son sütunu hesaplayın ve tamamlanmış tabloyu yeniden yazın.\nBir satırdaki sütunların virgülle, satırların ise \"|\" ile ayrıldığını unutmayın.\nGirdi: Ürün, Mikrar, Fiyat, Ara Toplam | mango, 5, 500, ? | elma, 4, 150, ? | yağ, 2, 1500, ?  \nFunction: sütun2 * sütun 3","task": "Self_Instruct", "answer": "Ürün, Miktar, Fiyat, Ara Toplam | mango, 5, 500, 2500 | elma, 4, 150, 600 | yağ, 2, 1500, 3000"},
{"question_id": 17, "text": "Lütfen her açıklamayla ilişkili Excel işlevinin adını yazınız.\nGirdi: - İki tarih arasındaki gün sayısını verir\n- Bir metin dizisinin içinde başka bir metin dizisinin başlangıç konumunu verir.\n- Verilen sayılar kümesinin ortasındaki sayıyı verir",
"task": "Self_Instruct", "answer": "- GÜNLER\n- BUL\n- ORTALAMA"},
{"question_id": 18, "text": "Word belgenizde dolgu içeriği olarak rastgele (ancak tutarlı) metin kullanmak için adımlar nelerdir?.", "task": "Self_Instruct", "answer": "Belgenize birkaç paragraf eklemek için hızlıca =rand() kullanabilirsiniz. İşte bu adımlar size nasıl kullanacağınızı gösterecek:\nMicrosoft Word imlecinizi (fare imlecini değil) rastgele metnin görünmesini istediğiniz yere koyun. İmleci bir satırın başına yerleştirmeniz gerekmektedir. İmlecin sadece başta olması gerekmektedir, boş bir satırda değil.\n2- =rand() yazın ve Enter tuşuna basın. Şimdi belgenize rastgele metin eklenmiş olacak."},
{"question_id": 19, "text": "Sunumlarınız için rahatlatıcı bir pastel renk paleti tasarlayın. Pastel renkler genellikle hoş ve narin görünür, bu nedenle sunumunuzun benzer bir ruh haline sahip olmasını isteyeceksiniz. En fazla beş renk veya renk kodu seçin..", "task": "Self_Instruct", "answer": "Renk kodları: #FDB3AE  #CAE4E2  #FBDF74"},
{"question_id": 20, "text": "Mağazadan iki gömlek aldım ve her biri bana 10 dolara mâl oldu. Ayrıca bir pantolon aldım ve bana 20 dolara mâl oldu. Sonra bir elbise aldım ve 30 dolara mâl oldu. Ayrıca bir çift ayakkabı aldım ve 40 dolara mâl oldu. Son olarak, bir ceket aldım ve 50 dolara mâl oldu.\n\nBu eşyaların sayısını ve fiyatını gösteren bir çizelge tablosu oluşturun. Sütunları \"|\" ile ayırın.", "task": "Self_Instruct","answer": "Ürün | Sayı | Fiyat\n\nGömlekler | 2 | $10\nPantolonlar | 1 | $20\nElbise | 1 | $30\nAyakkabı | 1 | $40\nCeket | 1 | $50"},
{"question_id": 21, "text": "Guardian veya Forbes gibi güvenilir kaynaklardan, verilen cümle veya ifadeyle tam olarak eşleşen cümleleri bulun. Ayrıca, her cümlenin kaynağını da belirtin.\nGirdi: Harika seçenekler var", "task": "Self_Instruct", "answer": "- Stella McCartney'nin sahte kürkü, moda, lüks ve etik kimlik bilgilerine sahip ve Dries Van Noten'de de harika seçenekler bulunmakta. (Independent)\n- Başkent Funchal'da, kendi yemeklerini hazırlayanlar için harika seçenekler var; ben eski şehirdeki bir sahil evinde kaldım, deniz kenarındaki villalardan oluşan koleksiyonun bir parçası (funchalcottages.co.uk). (The Guardian - Travel)\n- Dünya çapında şehir şehir alışveriş yapanlar, evlerine sadece özel ürünler değil, özel anılar da getirmek için harika seçenekler bulabilirler. (Forbes)\n- Evet, büyük bir şirkete  (henüz) ait olmayan harika seçenekler var ancak Twitter burada, uygulama İsviçre'si olarak hareket etmek ve bunu yaparken bazı reklam işlerini çekme fırsatına sahip. (TechCrunch)"},
{"question_id": 22, "text": "Yazarken aklımıza gelmeyen kelime için bir yıldız işareti (*) ekledik. Cümlede yıldız işareti yerine kullanılabilecek tüm kelimeleri göstermek için birkaç örnek vermeniz gerekecek.\nGirdi: biz * bilmek", "task": "Self_Instruct", "answer": "1- Bizim bilmemiz gerekiyor.\n2- Biz bilmek istiyoruz.\n3- Biz bilmek istedik.\n4- Biz nedenini bilmeyi hak ediyoruz.\n5- Biz nedenini bilmiliyiz."},
{"question_id": 23, "text": "Altı çizili kelime için alternatifler ve yeniden ifade etme şekilleri düşünün.\nGirdi: ne_bekliyorduk", "task": "Self_Instruct", "answer": "+ ne öngördük\n+ neyin beklentisi içindeydik\n+ ne bekledik\n+ ne umduk\n+ neye alıştık"},
{"question_id": 24, "text": "R (Programlama Dili) için bir beceri değerlendirme sorusu tasarlayın.", "task": "Self_Instruct", "answer": "S1. Bir matrisin bir veri çerçevesinden farkı nedir?\n2. Bu ifade hangi değeri verir?\nunclass(as.Date(\"1971-01-01\"))\n3. Veri çerçevesi gibi bir nesneyi çalışma alanından çıkarmak için ne kullanırsınız?\nS4. İki veya daha fazla sütun vektörünü birleştirerek bir veri çerçevesi oluşturmak için hangi işlev kullanılır?\nS5. Bu kodda y'nin değeri nedir?\nx <- NA\ny <- x/1"},
{"question_id": 25, "text": "Birinci Şahıs LinkedIn profil özeti için bir şablon yazın.","task": "Self_Instruct","answer": "[Okul]‘dan [Çalışma Alanı] alanında [Derece] aldıktan sonra ____, ____ ve ______’a olan tutkumu keşfetmek için [Sektör] dünyasına girdim. Şu anda [Şirket] için [İş Unvanı] olarak çalışıyorum ve burada ____, ____, ____ konularına odaklanmış durumdayım."},
{"question_id": 26, "text": "Yeni bir iş teklifini kabul ettiğinizi duyurmak için bir LinkedIn gönderisi yazın.", "task": "Self_Instruct",
"answer": "\\u201cI’m XYZ Şirketinde Pazarlama Direktörü rolünü kabul etme kararımı sizinle paylaşmak için kelimelerle ifade edemeyeceğim kadar heyecanlıyım! \nBen elde edemez’dim bu iş fırsatını, eğer bu fırsato benimle paylaşan arkadaşım [isim] ve mükemmel öneriler ve rehberlik sunan eski patronum [patronun adı] olmasaydı.\n Yeni yolculuğuma başlamak ve XYZ Şirketinin pazarlama yıldızlarıyla—yeni ailemle birlikte profesyonel olarak büyümek için sabırsızlanıyorum.”"},
{"question_id": 27, "text": "LinkedIn'e eklemek üzere yazılım mühendisleri için arzu edilen becerilerin bir listesini yapın.","task": "Self_Instruct", "answer": "Test Odaklı Geliştirme\nNesne Odaklı Programlama (OOP)\nMVC\nREST API\nTeknik Yazım\nHata Ayıklama"},
{"question_id": 28, "text": "LinkedIn Beceri değerlendirmelerinin bir parçası olarak aşağıdaki soruyu yanıtlamanız istenecektir.\nGirdi: Projenizde push-notifications olarak adlandırılmış hem bir tag hem de branch olduğunu fark ediyorsunuz, bu da verilen referansı yazdırmaya çalışırken karışıklığa neden oluyor. Hangi branch’e bakmak istediğinizi istediğinizi nasıl belirleyebilirsiniz?", "task": "Self_Instruct", "answer": "use git show refs/head/push-notifications"},
{"question_id": 29,"text": "Ürün başlığını alın ve özelliklerini çıkarın. Bu durumda özellikler, ürünlerin markası ve rengi gibi niteliklerini ifade eder. Cevabınız \"özellik: değer\" formatını takip eden bir liste olmalıdır.\nGirdi: SAMSUNG 980 PRO SSD 2TB PCIe NVMe Gen 4 Gaming M.2 Dahili Katı Hal Sabit Sürücü Bellek Kartı, Maksimum Hız, Termal Kontrol, MZ-V8P2T0B", "task": "Self_Instruct", "answer": "Marka: Samsung, Stil: 980 PRO, Kapasite: 2TB, Sabit Disk Arayüzü: NVMe, Sabit Disk Açıklaması: Solid State Hard Drive"},
{"question_id": 30, "text": "Alıcıyı ürünün faydalı olduğuna ikna edecek bir ürün açıklaması yazmalısınız.\nGirdi: Flipslide Oyunu, Elektronik Taşınabilir Oyun | Saati Yenmek için Çevir, Kaydır ve Renkleri Eşleştir- 4 Oyun Modu- Çok Oyunculu Eğlence", "task": "Self_Instruct","answer": "Flipside, bağımlılık yapan, çok oyunculu beceri gerektiren bir bulmaca oyunudur! Saati yenmek için renkleri çevirin, kaydırın ve eşleştirin. Hız Modu, Çok Oyunculu Mod, Seviye Modu ve Hafıza Modu dahil olmak üzere dört heyecan verici oyun modu, kendinize meydan okumanızı veya arkadaşlarınızla oynamanızı eğlenceli bir kafa dağıtma yöntemi hâline getirir! Evde, yolda veya istediğiniz her yerde oynayın! 8 yaş ve üzeri için önerilir."},
{"question_id": 31, "text": "Belirtilen ürünü ziyaret eden birisinin ilgisini çekebilecek diğer Amazon ürünleri nelerdir?\nGirdi: Zeroll Zerolon Hardcoat Eloksallı Ticari Dondurma Kepçesi, Benzersiz Sıvı Dolgulu Isı İletken Saplı Kolay Açılır ABD Malı, 1,5-Ons, Siyah", "task": "Self_Instruct", "answer": "- Buz Kepçesi, Moda Dondurma Kepçesi, Premium Paslanmaz Çelik Kurabiye Kepçesi, Köpek Maması Kepçesi, Sağlam Un Kepçesi, Yardımcı Şeker Kepçesi, Bulaşık Makinesinde Yıkanabilir (Gümüş/8oz/9 İnç)\n- AmazonCommercial Yapışmaz Isıya Dayanıklı Silikon Spatula Seti, 2 Küçük ve 2 Büyük Spatula, Çok Renkli, 4'lü Paket\n- Winco Akrilik 4 Delikli Dondurma Koni Standı, Şeffaf, Orta\n- Zeroll 1065FS-ZT Orijinal Zelato Tubmate Alüminyum Gelato Mala, Kendi Kendine Defrosting Sıvı Dolu Kolu, Daha Dayanıklı Kalın Bıçak, 9 İnç, Gri"},
{"question_id": 32, "text": "Verilen ürünü fiyat, derecelendirme vb.. özelliklere göre benzer ürünlerle karşılaştırın. Ürün karşılaştırması için tablo kullanın ve sütunları \"|\" ile ayırın.\nGirdi: Öğe: iBayam Günlük Planlayıcı Kalemler Renki Kalemler İnce Uçlu Keçeli Kalemler İnce Uçlu Çizim Kalemleri İnce Uçlu Pilot Kalemler Günlük Yazmak Yazı Yazmak Not Tutmak Takvim Boyamak Ofis içi Sanat Okula Dönüş Gereçleri, 18 Renk", "task": "Self_Instruct", "answer": "Ürün | bu ürün | İnce Uçlu Tahta Kalemi Renkli Kalem Seti, 0.38mm İnce Uçlu Kalemler, Gözenekli İnce Uçlu Çizim Kalemi, Kurşun Kalem ve Planlayıcıda Yazmak İçin Mükemmel, 24 Karışık Renkler | iBayam Fineliner Kalemler, 24 Parlak Renkli İnce Uçlu Kalemler, Günlük Yazma, Not Alma, Çizim, Boyama Planlayıcı Takvim, Ofis Okul Öğretmen Sınıfı İnce Uçlu İşaretleyici Kalemler | 24 renkli günlük kalemler, Not alma kalemleri 0.4mm ince uçlu pürüzsüz yazı kalemleri, Hızlı kuruyan keçe uçlu kalemler ajanda ofis okul öğretmeni sanat işaretleyici çizim malzemeleri\nMüşteri Puanı | 4.7 yıldız üzerinden 5 (87557) | 4.5 yıldız üzerinden 5 (2099) | 4.7 yıldız üzerinden 5 (8666) | 4.5 yıldız üzerinden 5 (396)\nFiyat | $6.39 | $7.66 | $8.99 | $10.99\nSatıcı | Qi US | ai-natebok | Qi US | MingNor\nRenk | Siyah, Gri, Kırmızı, Mavi, Magenta, Pembe, Mor, Menekşe, Soluk Sarı, Sarı, Turuncu, Çiğ Sienna, Sap Yeşili, C Yeşili, O Yeşili, Göl Mavisi, Yanmış Sienna, Kızıl | 24 Renk | 24 Renk | 24 renk\nÖğe Boyutları | 6.6 x 6.2 x 0.6 inç | 6.3 x 5.8 x 0.6 inç | 6.6 x 6.2 x 0.6 inç | 6.22 x 0.31 x 0.31 inç\nUç Tipi | İnce | Ekstra İnce | İnce | İnce"},
{"question_id": 33,"text": "Verilen bilgilere dayanarak bir inceleme yazın.\nGirdi: - Ürün: Persil Discs Çamaşır Deterjanı Paketleri, Orijinal Koku, Yüksek Verimli (HE) Uyumlu, Çamaşır Sabunu, 62 Adet\n- Duygu: Olumlu","task": "Self_Instruct", "answer": "Bu sabun markasını seviyorum, çocuklarımın kıyafetlerini her zaman tertemiz yapıyor. Bu sabunla yıkadıktan sonra çocuklarımın kıyafetleri temiz ve güzel kokuyor, hissettiriyor ve ben bunu çok seviyorum. İki kapsül sabunu yıkamaya koyuyorum ve eğer büyük bir yıkama varsa ve çocuklarımın kıyafetleri gerçekten kirliyse üç kapsül kullanıyorum ve kıyafetlerim ilk yıkamada temizleniyor ve bunu gerçekten seviyorum. Kesinlikle paraya değer. Aldığıma memnunum. Çok iyi çalışıyor. Kullanmayı seviyorum. Ailemizin kıyafetlerini, özellikle çocuklarımın kıyafetlerini temizlemek için gerçekten iyi karlı bir alışveriş!"},
{"question_id": 34, "text": "Verilen film veya dizi hakkında kısa bir açıklama yazın.\nGirdi: The Witcher (2019)", "task": "Self_Instruct", "answer": "Rivialı Geralt, kiralık bir canavar avcısıdır, insanların genellikle canavarlardan daha kötü olduğu çalkantılı bir dünyada kaderinde doğru yolculuğa çıkar."}, 
{"question_id": 35, "text": "Verilen diziyi seven birinin hoşuna gidebilecek bazı dizi veya filmleri düşünün.\nGirdi: Squid Game", "task": "Self_Instruct", "answer": "- 3%\n- Clickbait\n- Circle\n- Hellbound\n- Sweet Home"},
{"question_id": 36, "text": "Bu türdeki popüler dizi ve filmlere örnek verin.\nGirdi: Genre: Crime TV Shows", "task": "Self_Instruct", "answer": "Breaking Bad, Peaky Blinders, Arrow, Money Heist, Better Call Saul, DAHMER, The Blacklist, Lucifer, NCIS"},
{"question_id": 37, "text": "Verilen film veya dizi hangi türlere giriyor?\nGirdi: Manifest", "task": "Self_Instruct", "answer": "Gizem, Bilim Kurgu, Drama"}, 
{"question_id": 38, "text": "Verilen film ve dizi kategorileri hakkında kısa bir açıklama yapınız.\nGirdi: Dönem Dramaları", "task": "Self_Instruct", "answer": "Çağdaş dünyadan kaçmak ister misiniz? Muhteşem sanat ve kostüm tasarımı, bol drama ve çok fazla tarih içeren bu tarihi dramaları ve dizileri keşfedin."},
{"question_id": 39, "text": "Bir LATEX belgesinde otomatik olarak bir içindekiler tablosu nasıl oluşturulabilir? Örneğinizin gerekli komutları içerdiğinden emin olun.", "task": "Self_Instruct", "answer": "İçindekiler tablosunu oluşturmak oldukça basittir, \\tableofcontents komutu bu işi yapar. Bölümler, alt bölümler ve kısımlar içindekiler tablosuna dahil edilir. Girişleri manuel olarak eklemek için, örneğin numaralandırılmamış bir bölüm istediğinizde, aşağıdaki örnekte gösterildiği gibi \\addcontentsline komutunu kullanın: \n\n\\documentclass{article}\n\\usepackage{blindtext}\n\\usepackage{titlesec}\n\\title{Bölümler ve Bölümler}\n\\author{Gubert Farnsworth}\n\\date{ }\n\\begin{document}\n\\maketitle\n\\tableofcontents\n\\section{Giriş}\nBu ilk bölüm.\n\\blindtext\n\\addcontentsline{toc}{section}{Numarasız Bölüm}\n\\section*{Numarasız Bölüm}\n\\blindtext\n\\section{İkinci Bölüm}\n\\blindtext\n\\end{document}"},
{"question_id": 40, "text": "Bir satranç tahtasının FEN gösterimine sahip olduğunuzu düşünün. Satranç tahtasının bu durumunu LATEX’te göstermek için nasıl bir tahta çizebilirsiniz? Gerekli komutları ve paketleri içeren LATEX kodu oluşturun.", "task": "Self_Instruct", "answer": "Aşağıdaki örnek, skak paketi belgesinden alınan bir FEN örneğini göstermek için \\chessboard komutunda setfen anahtarını kullanır:\n\n\\documentclass{article}\n\\usepackage{xskak}\n\\begin{document}\n\\newchessgame\n\\chessboard[setfen=r5k1/1b1p1ppp/p7/1p1Q4/2p1r3/PP4Pq/BBP2b1P/R4R1K w - - 0 20]\n\\end{document}"},
{"question_id": 41,"text": "Verilen LATEX kodunun çıktısı nedir?\nGirdi: \\documentclass{article}\n\\begin{document}\nFirst document. Bu basit bir örnektir, içermez \nextra parametre veya pakerler.\n\\end{document}", "task": "Self_Instruct", "answer": "İlk belge. Bu, ekstra parametreler veya paketler içermeyen basit bir örnektir."},
{"question_id": 42, "text": "Elinizdeki görev için uygun olan birkaç LATEX şablonu bulmalu ve bunların bağlantılarını listelemelisiniz.\nGirdi: Ev Ödevi", "task": "Self_Instruct", "answer": "-https://www.overleaf.com/latex/templates/gijss-homework-template/xrhhfgqcfbft\n- https://www.overleaf.com/latex/templates/homework-solutions/xykkzgnbzmxp\n- https://www.overleaf.com/latex/templates/ocen-cfd-article-template/mtpnnssgzjzw\n- https://www.overleaf.com/latex/templates/pitt-state-physics-homework-template/wdsxknmntnxk"},
  
{"question_id": 43, "text": "Overleaf’e kaynakça veritabanı\n yüklemek için basit bir kılavuz yazın.", "task": "Self_Instruct", "answer": "Overleaf projesinde kullanmanız gereken bir kaynakça dosyanız varsa, bunu yükleyebilirsiniz. Sol panelin üst kısmında bulunan Yükle simgesine tıklayın. Bir iletişim kutusu açılacaktır, .bib dosyasını/dosyalarını sürükleyip bırakabilir veya cihazınızdan dosya yüklemek için bilgisayarınızdan seçin seçeneğini seçebilirsiniz. Yükleme işlemi tamamlandığında .bib dosyasını ana .tex belgenize dahil edebilirsiniz."},
{"question_id": 44, "text": "Verilen ruh haline uygun Spotify çalma listelerini seçin. Kolay erişim için bu çalma listelerine bir bağlantı sağlayın.\nGirdi: İyi Hissetmek", "task": "Self_Instruct","answer": "- https://open.spotify.com/playlist/37i9dQZF1DX9XIFQuFvzM4\n- https://open.spotify.com/playlist/37i9dQZF1DXcEKFjZJYZcc" },
{"question_id": 45, "text": "Ruh haline göre bir Spotify çalma listesi oluşturun. Bu listeyi bir şarkı listesi olarak yayınlayın.\nGirdi: Ruh Hali: hafta sonu kodlama", "task": "Self_Instruct", "answer": "- Candles by Jon Hopkins\n- Train from Paris by Mindtrap\n- Intro by The xx\n- Take Me Back by WYS\n- Riverline by Tor\n- The Dream by SwuM"},
{"question_id": 46,"text": "Verilen şarkı sözlerinin anlamını açıklayın nasıl açıklarsınız? Bazı metaforları açıklayın.\nGirdi: Sevgilim mizah sahibi\nO, cenazedeki kıkırdama\nHerkesin onaylamadığını biliyor\nOna daha önce tapmalıydım","task": "Self_Instruct", "answer": "Yazar, \"o komik\" gibi doğrudan bir ifade kullanmak yerine, \"o bir cenazedeki kıkırdama\" metaforunu tercih eder. Bu, yazarın sevgilisinin o kadar çok mizah dolu olduğunu ifade eden güçlü bir metafordur ki, gerçekten üzücü anlarda bile, anı hafifletmenin bir yolunu bulur."},
{"question_id": 47, "text": "İlk kez dinleyecek olanlar için bazı sesli kitaplar önerin. Popüler eserleri seçerek onların ilgisini çekebilirsiniz.","task": "Self_Instruct","answer": "+ Harry Potter ve Felsefe Taşı - J.K. Rowling\n+ The Vanishing Half - Brit Bennett\n+ Yüzüklerin Efendisi: Yüzük Kardeşliği - J.R.R. Tolkien\n+ And Then There Were None - Agatha Christie.\n+ The Woman in Cabin 10 - Ruth Ware.\n+ Otostopçunun Galaksi Rehberi - Douglas Adams.\n+ Spinning Silver - Naomi Novik.\n+ Good Omens - Terry Pratchett ve Neil Gaiman.\n+ Charlotte'un Sevgi Ağı - E. B."},
{"question_id": 48,"text": "En popüler podcast'lerin bir listesini yapın.","task": "Self_Instruct","answer": "+ En İyi Podcast'ler\n+ The Joe Rogan Experience\n+ Distractible\n+ Call Her Daddy\n+ Huberman Lab\n+ Anything Goes with Emma Chamberlain\n+ Stuff You Should Know\n+ The Psychology of your 20’s\n+ On Purpose with Jay Shetty\n+ Armchair Expert\n+ Archetypes\n+ Rachel Maddow Presents: Ultra\n+ The Mel Robbins Podcast\n+ Lex Fridman Podcast\n+ The Daily\n+ Think Fast, Talk Smart: Communication Techniques\n+ TED Talks Daily"},
{"question_id": 49,"text": "Durumu ve sorunu dikkatlice okumak için zaman ayırmalı ve elinizden gelen en iyi tavsiyeyi vermelisiniz.\nGirdi: Bir arkadaşımla Yeni Zelanda'ya doğru yola çıktık ve o beni deli ediyor. Gittiğimiz turların hiçbirinden keyif almadı ve hiçbir şey hakkında konuşmak istemiyor. Yolculuğumuzun bir haftasındayız ve tüm konuşma girişimlerimi reddettiği için başka biriyle takılırken hiç bu kadar sessiz olmamıştım. Arabada ve konaklama yerinde kulaklık takıyor -onunla konuşmaya çalışmayı sürdürdüğüm için değil. Dürüst olmak gerekirse, her şeye gerçekten kötü bir enerji getiriyor ve gezimi mahvediyor. Güney Adası için henüz bir şey ayarlamadık, bu yüzden onu Wellington'da feribotta bırakmayı planlıyorum. Picton'da kendi arabamı ayarlayıp gezimin geri kalanında yalnız kalmak istiyorum. (Bunu düşünmek bile beni duygulandırıyor ve ne kadar rahatlatıcı olduğunu hissettiriyor. Ondan uzaklaşmak için ne pahasına olursa olsun ödemeye hazırım.) Ona gezimi kötü enerjisiyle mahvettiğini söylemek elbette en iyi yaklaşım değil. En iyi yaklaşım ne olabilir ki dostça ayrılalım? Ya da en azından çok kırıcı duygularla biten bir tartışma yaşamayalım?", "task": "Self_Instruct", "answer": "Elinizden geldiğince dürüst ve nazik olun. Bir dahaki sefere otelde veya herhangi bir yerdeyken şöyle deyin: \"Hey dostum, X'e vardığımızda nasıl seyahat ettiğimiz konusunda gerçekten farklı olduğumuzu düşünüyorum ve bu ikimizi de strese sokuyor. O duraktan sonra ayrılmaya ne dersin?\""},
{"question_id": 50, "text": "Size bir dizi gerçek veya senaryo içeren bir açıklama veriliyor. Bu gerçekler ve senaryolardan bir hikaye oluşturmak size kalmış. Eksik parçalar hayal gücüyle ancak mantıklı bir şekilde doldurulmalı.\nGirdi: On Avrupa futbol takımı – Hollanda, İngiltere, Belçika, Danimarka, Fransa, Almanya, Norveç, İsveç, İsviçre ve Galler – kapsayıcılığı teşvik eden ve ayrımcılığa karşı çıkan sezon boyunca sürecek \"OneLove\" kampanyasına katılacak.","task": "Self_Instruct", "answer": "İsveç ve Norveç dışındaki tüm ülkeler Katar'da düzenlenecek 2022 Dünya Kupası'na katılmaya hak kazandı ve bu sekiz ülkenin her bir kaptanı turnuva boyunca tüm geçmişlerden renkleri içeren bir kalbin yer aldığı ayırt edici bir OneLove kol bandı takacak.\nKampanyaya öncülük eden Hollanda Futbol Federasyonu renkleri tüm mirasları, geçmişleri, cinsiyetleri ve cinsel kimlikleri temsil edecek şekilde seçti; kol bandı eşcinsel ilişkilerin cezai bir suç olduğu Katar'da takılacak. \İsveç ve Norveç önümüzdeki Uluslar Ligi maçlarında bu girişime katılırken, İngiltere de Kraliçe 2. Elizabeth'in vefatı dolayısıyla UEFA Uluslar Ligi maçlarında siyah kol bandı takacak. Bu futbol oyununa yakışan önemli bir mesajdır: sahada herkes eşittir ve bu toplumun her yerinde böyle olmalıdır. OneLove bandı ile bu mesajı ifade ediyoruz, dedi Hollanda kaptanı Virgil van Dijk.Hollanda takımı adına bir süredir bu bandı takıyorum. Diğer ülkelerin de bu girişime katıldığını görmek güzel.”\nOneLove, tüm futbol taraftarlarının en az bir ortak noktası olduğunu vurgulamak – futbol sevgisi– ve her türlü ayrımcılığa karşı ses çıkarmak amacıyla 2020 yılında Hollanda'da kuruldu.\nHalka yönelik mesajlara odaklanmanın yanı sıra, girişim aynı zamanda taban kulüplerine çeşitlilik eğitimi vermek için de geliştirildi.\n“Futbol sevgimiz hepimizi birleştiriyor. Nereden geldiğiniz, nasıl göründüğünüz ve kimi sevdiğiniz önemli değil. Futbol herkes içindir ve sporumuz dünyanın dört bir yanında ayrımcılık ve dışlanmayla karşı karşıya kalan insanlar için ayağa kalkmalıdır, dedi Almanya kaptanı Manuel Neuer. Diğer milli takımlardan meslektaşlarımla birlikte bu mesajı vermekten gurur duyuyorum. Her bir ses önemlidir.”\n Haziran ayında İngiltere kaptanı Harry Kane, Danimarka kaptanı Christian Eriksen ve Fransa kaptanı Hugo Lloris ile Katar'daki insan hakları konusunda ortak bir duruş sergilemeyi tartıştıklarını açıklamıştı. \Salı günü yaptığı açıklamada, "OneLove kampanyasını desteklemek üzere milli takım kaptanı arkadaşlarıma katılmaktan onur duyuyorum" dedi. "Kaptanlar olarak hepimiz sahada birbirimize karşı yarışıyor olabiliriz, ancak her türlü ayrımcılığa karşı birlikte duruyoruz. Bu, toplumda bölünmenin yaygın olduğu bir dönemde daha da önemlidir. Takımlarımız adına kol bandını birlikte takmak, dünya izlerken net bir mesaj gönderecektir.”"},
{"question_id": 51, "text": "Verilen sorguya dayalı olarak ilgili bazı arama sorguları önerin.\nGirdi: Fransızca öğrenmek","task": "Self_Instruct", "answer": "Yeni başlayanlar için Fransızca öğrenmek\nÇevrimiçi Fransızca öğrenmek\nÜcretsiz Fransızca öğrenmek\nFransızca dil kursu\nFransızca öğrenme yorumu\nKendi başınıza Fransızca nasıl öğrenilir\nÇevrimiçi Fransızca öğrenmenin en iyi yolu"},
  
{"question_id": 52,"text": "Verilen arama terimine dayalı olarak dikkate alınabilecek birkaç makale önerin. Makalelerin isimleri listelenmelidir.\nGirdi: ölçeklendirme yasası + makine öğrenimi", "task": "Self_Instruct", "answer": "- Ölçeklendirme yasaları aracılığıyla veri toplamayı sınırlandırmayı öğrenme: Veri minimizasyonunun yasal ilkesi için hesaplamalı bir yorum\n- Sinirsel makine çevirisi için veri ve parametre ölçekleme yasaları\n- Sinirsel ölçekleme yasalarını açıklama\n- Otoregresif üretken modelleme için ölçekleme yasaları\n- Sinir dili modelleri için ölçekleme yasaları"},  
{"question_id": 53, "text": "Verilen kişi veya şirket için bir e-posta imza şablonu hazırlayın.\nGirdi: bir bilgisayar bilimi yüksek lisans öğrencisi","task": "Self_Instruct", "answer": "[Adınız]\nBilgisayar Bilimleri [Dereceniz]\n[Üniversiteniz]\n\nWeb Sitesi: [Web siteniz]\nORCID ID: [ORCID Kimliğiniz]"},
{"question_id": 54, "text": "Müşterilerinizden gelen yorumlara uygun şekilde tepki verin. Yanıtlarınızda işletmenizin politikalarını ve müşteri hizmetlerinizi vurgulayabilirsiniz.\nGirdi: Bir başka iadeiziyaret ve hiç hayal kırıklığımız yok. Kahvaltı veya brunch için harika bir yer - ve bir süre yemek yemeniz gerekmeyecek. Restoran Tenderloin'a yakın, bu yüzden çevrenizin farkında olun. Succotash Omlet (en azından karım ​​sevdi), Çekilmiş Domuz Benedict ve Hangtown Kızartmasını beğendik. Porsiyonlar büyük ve fiyatlandırma makul. Bir Beignet Uçuşu yapabilseydik keşke! Kesinlikle aramaya değer bir yer. Zaman zaman kalabalık olabilir, bu yüzden sabırlı olun. Beklemeye değer.", "task": "Self_Instruct",
"answer": "Merhaba [müşteri adı], bu harika geri bildirim için çok teşekkür ederiz. [Restoran adı]'ndan hoşlandığınızı ve deneyiminizi beğendiğinizi duyduğumuza çok sevindik! Destekleriniz için çok minnettarız ve sizi tekrar ağırlamayı sabırsızlıkla bekliyoruz! Teşekkürler!"}, 
{"question_id": 55,"text": "İyi bir Twitter Biyografisi yazın. Oluşturduğunuz biyografide belirtilen tüm ana noktaları kapsamaya çalışın.\nGirdi: Ad: Jane\nAna noktalar:\n- Mimar\n- Teknoloji ile ilgileniyor\nBirinci şahıs ağzından yazılmış\nRahat bir ton kullanın",
"task": "Self_Instruct", "answer": "Kendimi bir tür mimar olarak görüyorum. Teknolojiyle ilgileniyorum ve bir şeyleri nasıl daha iyi hale getirebileceğime dair yeni fikirler üretmeyi seviyorum."}, 
{"question_id": 56,"text": "Şirket haberlerini ve gerçeklerini paylaşmak için tematik bir tweet yazmamız gerekiyor. Lütfen verilen gerçeklere ve ayrıntılara dikkatlice bakın ve bunlara dayalı bir tweet oluşturun.\nGirdi: - Haberler: Yaz staj başvuruları şimdi başladı\n- Cadılar Bayramı ile ilgili bir tematik bağlantı ile başlayın", "task": "Self_Instruct","answer": "Cadılar Bayramı yaklaşıyor ve biz de bunu heyecan verici haberlerle kutluyoruz: yaz stajlarımız için başvurular başladı! Bu yaz bizimle çalışmak istiyorsanız, sizden haber almak isteriz. [Şirket adı] için tutkulu ve büyümemize katkıda bulunmaya kararlı insanlar arıyoruz. Eğer bu sizi tanımlıyorsa, tüm detaylar için web sitemize göz atın: [web sitesi adresi]."},
{"question_id": 57,"text": "Bir iş tanımı, belirli bir rolü yerine getirmek için gerekli gereksinimleri, görevleri, sorumlulukları ve becerileri açıkça belirten bir belgedir. Verilen bilgilere dayalı olarak bir iş tanımı yazmanız gerekmektedir. İş tanımınızda sorumlulukları ve görevleri mantıklı bir sırayla açıklayın. Potansiyel çalışanlar genellikle şirketiniz hakkında ilk izlenimi iş tanımınızdan alırlar. Bu nedenle, iş tanımı şirketinizin çekiciliğini vurgulamalıdır.\nGirdi: Şirket: [Şirket adı]\nİş: Yazılım Mühendisi\nİş Sorumlulukları:\nDiğer mühendislerle birlikte kod incelemeleri almak ve gerçekleştirmek.\nPytest gibi otomatik test çerçevelerini kullanarak işlevselliği doğrulamak için birim, entegrasyon ve uçtan uca testler yazın.\nİş paydaşları tarafından talep edilen özellikleri oluşturmak için diğer yazılım mühendisleriyle iş birliği içinde çalışın.\nApache Spark gibi büyük veri işleme sistemlerini kullanarak karmaşık veri işleme hatlarını ve veri analizi uygulamalarını geliştirmek, test etmek ve hata ayıklamak için Agile ekiplerine katılın.\nSorunların ve kusurların kök neden analizini teşhis edin, hata ayıklayın ve gerçekleştirin.\nBaşarıya götüren beceriler ve deneyimler:\nModern bir yazılım programlama dili ile deneyim. Biz Python ve Pyspark kullanıyoruz.\nAWS veya Azure gibi bulut sistemleri ile deneyim\nSQL sorguları yazma deneyimi\nGüçlü yazılı ve sözlü iletişim becerileri\nYüksek işbirlikçi bir ortamda çalışma isteği\nTableau veya PowerBI gibi bazı görselleştirme deneyimi faydalıdır", "task": "Self_Instruct", "answer": "Yazılım Mühendisi\n[Şirket adı], ekibimize katılacak motive olmuş bir yazılım mühendisi arıyoruz. Büyük ölçekli veri işleme sistemleri ve bulut veri analizi konusunda deneyimli bir ekip olarak çalışıyoruz.\nGörevleriniz, diğer mühendislerle birlikte kod incelemelerini almak ve gerçekleştirmek , Pytest gibi otomatik test çerçevelerini kullanarak işlevselliği doğrulamak için birim, entegrasyon ve uçtan uca testler yazmak, iş paydaşları tarafından talep edilen özellikleri oluşturmak için işbirliği içinde çalışmak, Agile ekiplerine katılarak Apache Spark gibi büyük veri işleme sistemlerini kullanarak karmaşık veri işleme hatlarını ve veri analizi uygulamalarını geliştirmek, test etmek ve hata ayıklamak olacaktır.\nSorunların ve kusurların kök neden analizini teşhis etme ve hata ayıklama yeteneğinizin yanı sıra, Tableau veya PowerBI gibi görselleştirme araçları konusunda bazı deneyimlere sahip olmanız gerekmektedir.\nBaşarıya götüren beceriler:\nPython programlama dili deneyimi; AWS veya Azure gibi bulut sistemleri deneyimi; SQL sorguları yazma deneyimi; güçlü yazılı iletişim becerileri; yüksek iş birlikçi bir ortamda çalışma isteği."},
{"question_id": 58, "text": "Reddedilme nedenini göz önünde bulundurarak, bir adayı reddetmek için kibar bir ret mektubu yazın.\nGirdi: Neden: İkinci sırada geldiniz", "task": "Self_Instruct",
"answer": "Sevgili [Aday Adı],\n\n[Şirket adı]'na başvurduğunuz için teşekkür ederiz! Başvurunuzu reddetmekten dolayı üzgünüz.\nGirişiminizden etkilendik ve sizinle çalışma fırsatına sahip olmayı çok isterdik. Ancak şu anda, şirketimizde herhangi bir pozisyon teklif edemiyoruz.\nBaşvurunuzu reddettiğimiz için içten özürlerimizi kabul edin ve gelecekte sizinle çalışmaya açık olduğumuzu bilin!"},  
{"question_id": 59, "text": "Blog yazımız için başlık ve konuya zaten karar verdik. Okuyucuların dikkatini çekmek için giriş paragrafı yazarsanız çok memnun olurum.”\nGirdi: Blog başlığı: Sağlıklı Elmalı Muffinler\nBlog Konusu: iyi bir elmalı muffin pişirmek için tarif ve ipuçları","task": "Self_Instruct", "answer": "Elmalı muffin yapmak son derece kolaydır ve harcadığınız çabaya kesinlikle değer. Daha önce hiç aşçı ya da fırıncı olmadıysanız, bunları yapmanın fikrinizi değiştireceğine söz verebilirim. Ve eğer işinizi görmezlerse, en azından tadı güzel olacaktır!"},
{"question_id": 60, "text": "Verilen bilgiye dayalı olarak bir blog yazısı için detaylı bir taslak hazırlayın ve bölümleri buna göre listeleyin.\nGirdi: Bu blog yazısı, son dakika hediye fikirlerinin bir listesini yapmak hakkında olacak. Ayrıca, yazının tonu rahat ve gündelik olacak.", "task": "Self_Instruct", "answer": "Bölüm: Favori bir restorana veya mağaza için hediye kartı\nBölüm: Sinema bileti\nBölüm: Masaj veya manikür/pedikür\nBölüm: Eğlenceli bir oyun konsolu\nBölüm: Kitaplar\nBölüm: Mumlar, pille çalışan mumlar\nBölüm: Telefonlar/tabletler için taşınabilir pil şarj cihazı\nBölüm: Su filtreli sürahi\nBölüm: Fotoğraflarla/çizimlerle kişiselleştirilmiş eşyalar\nBölüm: Favori takım eşyaları (şapka, sweatshirt)\nSonuç: Hediye almak için vaktiniz kalmadı konusunda diye strese girmeyin, bir hediye yapın."},
  
{"question_id": 61, "text": "Bir blog yazısı için bir bölüm yazın ve metninizde bu bölümle ilgili verilen tüm bilgileri kapsamaya çalışın. \nGirdi: Blog Konusu: Seyahatinizde Yanınıza Almanız Gereken 7 Sonbahar Moda Trendi\nBölüm Başlığı: Güvenilir Kotlar\nBölümün ana fikri: kotlar yıl boyunca giyilebilir ve her şeyle iyi görünür.", "task": "Self_Instruct","answer": ""Kot pantolonların en ikonik moda ürünlerinden biri olmasının bir nedeni var – her şeyle harika görünürler ve yıl boyunca giyilebilirler. Bu Sonbaharda trendler daha bol kesimlere yönelirken, nereye giderseniz gidin en sevdiğiniz, güvenilir kot pantolonunuzu yanınıza almanız şart. Eğer bol jean trendine ayak uyduramıyorsanız, en azından düz paça bir jean tercih edin ve dar paçalardan kurtulun."},
{"question_id": 62, "text": "İndirimle ilgili bir Instagram gönderisi için ayrıntılı bir başlık oluşturun. Uygun bir altyazı ürünü açıklamalı, indirimi sunmalı ve kullanıcıya indirimi nasıl talep edeceğini söylemelidir.\nGirdi: Ürün: Golang kursu\nÜrün açıklaması: bulut hizmetleri, web uygulamaları, DevOps araçları ve arka uç geliştirme için temel becerileri öğretmek\nİndirim: %50\nNasıl talep edilir: Kupon kodunu kullanın: GOLANG", "task": "Self_Instruct", "answer": "Yeni Golang kursumuzu başlattık. Bu kursta, bulut hizmetleri, web uygulamaları, DevOps araçları ve arka uç geliştirme ile ilgili yüksek maaşlı kariyerler için gereken temel becerileri öğreneceksiniz. Kursu tamamladığınızda, son kullanıcıların etkileşimde bulunabileceği ve bir REST API olarak tüketebileceği bir web sunucusu oluşturabileceksiniz.\nÖğrenme çıktıları\nMezun olarak şunları yapabileceksiniz:\n1- Go'nun benzer dillere göre avantaj ve dezavantajlarını açıklayın.\n2- Bir projeyi Go'da geliştirmek için bir iş vakası tasarlayın.\n3- Bir Go ortamı kurun.\n4- Go kullanarak temel bir arka uç programlayın.\nKurs projesini görmek için Golang kursu müfredatına göz atın.\n\nBu hafta kayıt olun ve yeni kursumuzun özel teklifi ile %50 tasarruf edin. Golang kursuna abone olurken indirimden yararlanmak için GOLANG kupon kodunu kullanın. Öğrenmeye başlayın - bu özel promosyon sadece [tarih] kadar geçerlidir."},
{"question_id": 63, "text": "Verilen ayrıntılara dayanarak büyüleyici bir Instagram gönderisi başlığı oluşturun. Mümkün olduğunca çok başlık düşünmeye çalışın.\nGirdi: Yılın ilk karının bir ofis penceresinden çekilmiş görüntülerini paylaşıyorum", "task": "Self_Instruct", "answer": "- Kar yağıyor! İşte ofis penceremizden yılın ilk karı.\n- Bırakın fotoğraflar konuşsun. Yılın ilk karı yağmak üzere.\n- Dışarıda çok kar yağmıyor ama ofis penceremizden yılın ilk kar tanelerini görmek bile kışın nihayet geldiğini hissettiriyor. :D\n- Yılın ilk karı ve benim keyfim yerinde çünkü yapmayı en çok sevdiğim şeyi yapıyorum: Instagram'da kar resimlerine bakıyorum\n- Yılın ilk karı ve ben ofis koltuğumda rahatlıyorum. \n- Kar Kıyameti: ilk karın tatlı, narin sevinci.\n- Kar günü: haftaya harika bir başlangıç!\n- Ofisee kar yağıyor ve hiç de kızgın değilim.\n- Ofisime kar yağıyor. Uzun termal içliğimi giyiyorum, sıcak çikolata içiyorum ve Game of Thrones izliyorum. Sen ne yapıyorsun?"},
{"question_id": 64, "text": "Bir Instagram gönderisi için size bir konu verildi. Gönderiyle ilgili hashtag'ler önererek gönderinin daha geniş bir kitleye ulaşmasına yardımcı olun.\nGirdi: Bilimde kadınlar konulu bir başka bölüm şimdi yayında", "task": "Self_Instruct", "answer": "#WomeninSTEM #WomenScience #bilim #araştırma #stemPodcast"},
{"question_id": 65,"text": "Verilen metindeki anlamı iletmek için uygun emojileri kullanın.\nGirdi: Cute cat\nplayful\nSoft", "task": "Self_Instruct", "answer": " Cute cat\n playful\n Soft"},  
{"question_id": 66,"text": "Bir YouTube gönderisinin konusu tanımlandı ve bu bilgilere dayanarak gönderiyi başlatmak için bir açılış cümlesi yazmanız gerekiyor. Akılda kalıcı çekici bir açılış cümlesi, okuyucularınızın ilgisini çekerek okumaya devam etmelerini sağlayacaktır. Mümkün olduğunca çok açılış cümlesi oluşturmaya çalışırsanız harika olur.\nGirdi: Lezzetli bir kahve fincanı nasıl yapılır gösteren bir video", "task": "Self_Instruct", "answer": "- Harika bir kahve fincanı nasıl yapılır? Bir profesyonele sorduk.\n- Dünyanın en iyi kahve dükkanlarının gerçek hayat hikayeleri.\n- Bunu izledikten sonra kesinlikle bir fincan kahve isteyeceksiniz, bu yüzden kaçırmayın.\n- Kahve, çoğu insanın her gün içtiği bir şeydir. Bu video size onunla ilgili her şeyi anlatıyor.\n- Sizi daha iyi bir barista yapacak 7 alışkanlık hakkındaki bu videoyu izleyin."},
{"question_id": 67, "text": "Verilen konuyu başlangıç ​​noktası olarak kullanarak YouTube'da bu konuda yapılabilecek video fikirleri oluşturun.\nGirdi: Erteleme size kötü hissettirmesine rağmen neden ertelersiniz?", "task": "Self_Instruct", "answer": "+ Ertelemenizin nedeni\n+ Erteleme hakkında bir belgesel\n+ Ertelemeyi bırakma\n+ İnsanların erteleme alışkanlıklarını konuşmalarını kaydetme\n+ Erteleyen insanlarla röportaj yapma\n+ Yeni Yıl kararlarını yerine getiremeyen insanlar nedenini açıklıyor"},
{"question_id": 68, "text": "Videonun içeriğine dayalı olarak bir YouTube video başlığı seçmelisiniz. Bir videonun başlığı izleyicilere ne beklemeleri gerektiğini söyler. Dürüst, net ve açık olmalıdır. Videonun başlığı, izleyicilerin dikkatini çekmelidir, bu yüzden belirsiz veya muğlak bir başlık kullanmayın.\nGirdi: Egzersizin gerçekten metabolizmanızı \"artırabileceğini\" belirlemek için bir araştırma yapıldı.","task": "Self_Instruct", "answer": "Egzersiz ve Metabolizma Üzerine Yapılan Son Çalışmanın Sonuçlarına İnanamayacaksınız!"},
{"question_id": 69,"text": "Ürün veya işletme YouTube kanalınız için bir isim seçmek sürecin önemli bir parçasıdır. Ürün veya işletme tanımına dayanarak bazı ilginç isimler bulmanız gerekmektedir. Fikirleriniz üzerinde beyin fırtınası yapmak için biraz zaman ayırın.\nGirdi: Burada öğrencilerin lisansüstü okullara başvuru sürecine hazırlanmasına yardımcı olacak videolar ve içerikler bulacaksınız ve ayrıca lisansüstü okullara nasıl başvurulacağı konusunda rehberlik edilecektir.","task": "Self_Instruct", "answer": "GradSchoolPrep, GoGradSchool, GradSchoolVidz, Apply2Gradschool"},
{"question_id": 70,"text": "Altı çizili SAT kelimelerinin anlamını en iyi açıklayan cevabı bulun. Doğru seçeneği seçin ve altı çizili kelimenin anlamını açıklayın.\nGirdi: _Kakafoniye rağmen, öğrenci ders çalışmaya çabaladı. \nA. Yüksek sesler\nB. Zor konu\nC. Geç saat\nD. Düşük aydınlatma", "task": "Self_Instruct", "answer": "A. Yüksek sesler. “kötü ses” anlamına gelse de, kakofoni artık \u201renkler veya kokular gibi diğer şeylerin uyumsuz veya kaotik karışımı” anlamına da gelebilir."},
{"question_id": 71, "text": "Verilen kelimenin eş anlamlılarını bulun. Sağlanan eş anlamlıların orijinal kelimeden anlam, kullanım vb. açısından nasıl farklılık gösterdiğini yazmanız gerekmektedir.\nGirdi: şanssızlık", "task": "Self_Instruct", "answer": "- talihsizlik: Talihsizlik ve şanssızlık kelimeleri eş anlamlıdır ancak nüans bakımından farklılık gösterir. Talihsizlik özellikle hafif bir rahatsızlık veya küçük bir sıkıntı içeren bir durumu ifade eder.\n- terslik: Terslik ve şanssızlık anlamları büyük ölçüde örtüşür; ancak, terslik, talihsizlik sonucunda meydana gelen üzücü bir olay veya durum anlamında kullanılabilir.\n- aksilik: Aksilik ve şanssızlık kelimeleri bazen birbirinin yerine kullanılabilir, ancak aksilik genellikle küçük bir talihsizlik örneğini ifade eder."},
{"question_id": 72, "text": "Verilen kelimenin kökenlerini ve tarihini tartışın.\nGirdi: eğik", "task": "Self_Instruct", "answer": "Orta İngilizce oblique, oblike, Anglo-Fransızca oblic, oblique kelimesinden türemiştir, Latin oblīquus \"eğik, çapraz\" anlamına gelir, ob- \"karşı, karşısında\" + -līquus, anlamı  ve kökeni belirsizdir."},
{"question_id": 73, "text": "Verilen marka için pazarlama stratejilerinin bir parçası olarak kullanabileceği bir slogan önerin.\nGirdi: Dondurma dükkanı, tarihi bölgenin kalbinde bulunan küçük, şirin bir dükkandır. Çeşitli dondurma tatlarının yanı sıra İtalyan buzu, gelato ve sorbe de sunmaktadır. Dükkanın birkaç masası ve sandalyesi vardır ancak işlerinin çoğu paket servistir. 10 satın alımdan sonra bir bedava dondurma kaşığı alabileceğiniz bir sadakat programı sunuyorlar.","task": "Self_Instruct", "answer": "- Bir kaşık dostluk!\n- Gelin ve bir ikram alın!\n- Tatlı bir ikram için uğrayın ve bizi görün."},
{"question_id": 74,"text": "Duruma uygun şekilde bir onay e-postası yazılmalıdır.\nGirdi: Bir toplantı planlanlanmıştır ve gönderen diğer kişiden slaytları gözden geçirmesini beklemektedir.","task": "Self_Instruct", "answer": "Merhaba [isim],\n\nUmarım şu ana kadar sizin için harika bir hafta olmuştur. Toplantımızı planladığımızı ve ekibinizin önümüzdeki hafta gelmesi için bir zaman ayarladığımızı bildirmek istedim. Gözden geçirmeniz için bazı slaytlar hazırlayacağım ve herhangi bir sorunuz olursa, bunları yanıtlamaktan memnuniyet duyarım! Müsait olduğunuzda bana [e-posta] adresinden e-posta gönderebilirsiniz.\n\nBu proje üzerindeki tüm yardımlarınız için çok teşekkür ederiz —Başlamak için heyecanlıyız!" başlamayı dört gözle bekliyoruz!"},
{"question_id": 75, "text": "Maaşınızı görüşmek için bir e-posta yazmanız gerekiyor.", "task": "Self_Instruct","answer": "Sayın [işe alım müdürünün adı],\n\nTeklifi kabul etmek istediğimi belirtmek için zamanınızdan alıyorum. Bu pozisyon için beni düşündüğünüz için onur duydum ve sizinle çalışacağım için heyecanlıyım.\nMaaşın belirlenmesinin kolay bir iş olmadığını biliyorum, bu yüzden yetenek setimin önerilen maaştan neden daha değerli olduğuna inandığımı açıklamak istiyorum.\n[Pozisyon unvanı] olarak deneyimim, proje yönetimi becerilerinin yanı sıra güçlü yazılı iletişim becerileri ve şirketin ürün tekliflerini derinlemesine anlama gerektiren bu role beni iyi bir şekilde hazırlayacaktır. Bunlar, son birkaç yılda önemli deneyimler kazandığım ve şirketinizde de başarılı olacağımdan emin olduğum alanlardır.\n\nUmarım yakında bir anlaşmaya varabiliriz!"},
{"question_id": 76,"text": "Katılımcılara etkinliğin yaklaştığını hatırlatmak için bir e-posta yazın.","task": "Self_Instruct","answer": "Merhaba, [isim]!\n\nKayıt olduğunuz [etkinlik adı] etkinliğini duyurmaktan heyecan duyuyoruz. Etkinlik [konum] konumunda, [tarih ve saat] tarihinde ve saatinde gerçekleşecektir.\n\nEtkinlik hakkında herhangi bir sorunuz veya endişeniz varsa, lütfen [e-posta] adresinden bize ulaşarak bize bildirin."},
{"question_id": 77,"text": "Depo için bir kısaltma önerebilirseniz çok yardımcı olur.\nGirdi: Gürültülü Orta Ölçekli Kuantum (NISQ) devrelerini oluşturmak, düzenlemek ve çağırmak için bir Python çerçevesi.","task": "Self_Instruct","answer": "Cirq"},
{"question_id": 78, "text": "GitHub birleşme çakışmalarını çözmek için adım adım bir kılavuz yazın.","task": "Self_Instruct","answer": "1- Depo adınızın altında, Çekme İsteklerine (Pull Requests) tıklayın.\n2- \"Pull Requests\" listesinde, çözmek istediğiniz birleşme çakışması olan pull request'e tıklayın.\n3- Pull request'inizin altında, Çakışmaları Çöz'e tıklayın.\n4- Yalnızca branch’inizin değişikliklerini saklamak, yalnızca diğer branch değişikliklerini saklamak veya her iki branch değişiklikleri içerebilecek yeni bir değişiklik yapmak arasında karar verin. Çakışma işaretleyicilerini <<<<<<<, =======, >>>>>>> silin ve nihai birleştirmede istediğiniz değişiklikleri yapın.\n5- Dosyanızda birden fazla birleşme çakışması varsa, sonraki çakışma işaretleyicilerine gitmek için aşağı kaydırın ve birleşme çakışmanızı çözmek için dört ve beşinci adımları tekrarlayın.\n6- Dosyadaki tüm çakışmaları çözdüğünüzde, Çözüldü olarak işaretleye tıklayın.\n7- Çakışma olan birden fazla dosyanız varsa, sayfanın sol tarafındaki \"çakışan dosyalar\" altında düzenlemek istediğiniz sonraki dosyayı seçin ve tüm pull request'inizin birleşme çakışmalarını çözene kadar dört ila yedinci adımları tekrarlayın.\n8- Tüm birleşme çakışmalarınızı çözdüğünüzde, Birleşme taahhüdüne tıklayın. Bu, tüm temel branch’i baş brach’inizle birleştirir.\n9- İstendiğinde, taahhütte bulunduğunuz brach’i gözden geçirin.\nBaş branch’iniz deponun varsayılan branch’iyse, birleşme çakışmasını çözmek için yaptığınız değişikliklerle bu branch’i güncellemeyi veya yeni bir branch oluşturarak bunu pull request'in baş branch’i olarak kullanmayı seçebilirsiniz.\nYeni bir branch oluşturmayı seçerseniz, branch’e bir ad girin.\nPull request'inizin baş branch’i korumalıysa, yeni bir branch oluşturmanız gerekmektedir. Korumalı branch’i güncelleme seçeneğiniz olmayacaktır.\nBranch oluştur ve pull request'imi güncelle veya Anladım, BRANCH'i güncellemeye devam et'e tıklayın. Düğme metni, gerçekleştirdiğiniz eyleme karşılık gelir.\n10- Pull request'inizi birleştirmek için Birleştirme pull request'ine tıklayın. Diğer pull request birleştirme seçenekleri hakkında daha fazla bilgi için \"Pull request'i birleştirme\" bölümüne bakın."},
{"question_id": 79,"text": "Bir veya daha fazla, iş bir iş akışı tarafından otomatik olarak çalıştırılabilir. İş akışları depoda YAML dosyaları olarak tanımlanır ve depoda bir olay meydana gelirse, manuel olarak veya belirli bir programda çalıştırılır. .\nGitHub Actions'ın CI/CD özelliklerini gösteren bir iş akışı örneği getirin.", "task": "Self_Instruct","answer": "Bir çalıştırıcıda kodunuzu test etmek için komut dosyaları kullanmak yaygın bir örnektir. Bu iş akışı tetiklendiğinde, otomatik olarak bir komut dosyası çalıştırır."},
{"question_id": 80,"text": "Film sloganı, genellikle resmi gösterimden önce posterlere basılan filmin reklam sloganıdır. Bir filmin kısa bir açıklaması veya yorumu olup, filmin özünü yakalamayı ve nihayetinde filmi izlemenizi sağlamayı amaçlar. İşte bir örnek:\nGirdi: Film: Joker (2019)", "task": "Self_Instruct", "answer": "Mutlu bir yüz ifadesi takın."},
{"question_id": 81,"text": "Size bir filmle ilgili bazı yorumlar verilmiştir. Her videoda, film hakkında bazı olumsuz veya olumlu noktalara değinilmiş olabilir. Bunları dikkatlice okuyun ve tüm incelemelerde belirtilen olumlu ve olumsuz noktaları çıkarın. Ardından, bu noktaların bir listesini yapın ve bunları olumlu ve olumsuz noktalar olarak özetleyin.\nGirdi: İnceleme 1: Bu filmde Ed Norton'un beni rahatsız etmesinden mi kaynaklanıyor bilmiyorum ama Dövüş Kulübü'nün kültürel bir fenomen olduğu fikrine hiçbir zaman gerçekten inanmadım. Evet, yenilikçi bir hikaye, güçlü bir senaryo, ilgi çekici karakterler ve yoğun sinematografi ile anlatılıyor. Ama bu kadar övgüyü gerçekten hak ediyor mu? Şahsen ben, filmin yarısından sonra dağılmaya başladığını ve aslında sonuna doğru oldukça sıkıcı hale geldiğini düşünüyorum. Hikaye, temel unsurlarıyla bağını kaybettikçe ve makineye karşı öfke havası hakim oldukça her şey biraz çocukça ve yapmacık bir hal alıyor. Bu filmin yapımına büyük saygı duyuyorum ancak tıpkı Matrix gibi, insanların bu filme hak ettiğinden daha fazla önem atfettiğini düşünüyorum.\nİnceleme 2: Film, Tyler Durden liderliğindeki, bugünün dünyasında sosyal düzene uyum sağlayamayan erkeklerin, doğal içgüdülerini, erkekliklerini keşfetmelerini ve mutsuz yaşamlarından kaçmalarını anlatıyor.\nİnceleme 3: Bu filmin iyi bir tema, harika oyunculuk ve sıradışı bir şekilde ilettiği önemli mesajları olmasına rağmen, hikayeyle izleyici arasında bağ kuramadığını ve onu bir kafa karışıklığı dünyasında bıraktığını düşünüyorum. Çoğu eleştirmen bu filmi eğlenceli ve ilginç bulsa da, bu filmin aşırı derecede abartıldığını düşünen azınlıktan biri olmayı tercih ediyorum.\nİnceleme 4: Maddi prangalarda kurtulmanın yolu kaos yaratmak, patlamalar ve militan bir tarikata üye olmak mı? Görsel efektler büyüleyici ve hikaye ikinci yarıya kadar sürükleyici. Ne yazık ki sonu iyi bitmiyor.","task": "Self_Instruct","answer": "Olumlu noktalar:\n- Yenilikçi hikaye\n- Güçlü senaryo\n- İlgi çekici karakterler\n- Yoğun sinematografi\n- İyi tema\n- Harika oyunculuk\n- Önemli mesajlar\n- Büyüleyici görsel efektler\n\nOlumsuz noktalar:\n- Ed Norton'un izleyiciyi rahatsız etmesi\n- Yarısından sonra çözülmeye başlaması\n- Sonuna doğru çocukça ve yapmacık hale gelmesi\n- Temel unsurlarından kopması\n- Kafa karışıklığı\n- Abartılmış olması"},
{"question_id": 82,"text": "Filmin veya dizinin konusunu kısaca özetleyin.\nGirdi: Breaking Bad (TV Dizisi 2008–2013)","task": "Self_Instruct","answer": "Walter H. White bir kimya dehasıdı ancak New Mexico'nun Albequerque şehrindeki bir lisede kimya öğretmeni olarak çalışmaktadır. Kendisine, III. evre ölümcül akciğer kanseri teşhisi konduğunda ve yaşaması için birkaç ay gibi kısa bir süre kaldığında hayatı büyük ölçüde değişir. Engelli oğlunun ve hamile eşinin mali geleceğini sağlamak için Walt, kimya geçmişini kullanarak dünyanın en kaliteli kristal metamfetaminini üretir ve satar. Kendisine özgü \"mavi meth\" i satmak için eski öğrencisi Jesse Pinkman ile iş birliği yapar. Metamfetamin, onları çok kısa sürede çok zengin eder ancak bu durumDEA'da çalışan kayınbiraderi Hank'in dikkatini çeker. Walt ve Jesse'nin uyuşturucu dünyasındaki statüsü yükseldikçe, Walt tehlikeli bir suçluya, Jesse ise sinirli bir satıcıya dönüşür. Hank her zaman onun peşindedir ve bu, Walt'un izlerini örtmek için yeni yollar bulmasını gerektirir."},
{"question_id": 83,"text": "Çocukların verilen filmi izleyip izleyemeyeceğine karar verin. Eğer, izlememeleri gerektiğini düşünüyorsanız, neden uygunsuz olduğunu belirtin.\nGirdi: Kara Şövalye (2008)","task": "Self_Instruct","answer": "Hayır, çocuklar Kara Şövalye filmini izlememelidir. Film, yoğun şiddet ve aksiyon sahneleri, bazı tehditkar sahneler ve kısa dil kullanımı nedeniyle PG-13 olarak derecelendirilmiştir."},
{"question_id": 84,"text": "Filmin sinematografisini kısa bir şekilde analiz edin.\nGirdi: Ölü Ozanlar Derneği","task": "Self_Instruct", "answer": "'Ölü Ozanlar Derneği' filminde karakterler arasındaki belirli duyguları vurgulamak için kamera açıları ve kamera teknikleri gibi film teknikleri kullanılmıştır. Film teknikleri, izleyicinin belirli bir sahnenin temasını, karakterini, duygusunu ve belirli bir sahnenin ortamını anlamasına yardımcı olmak için kullanılır. Tüm filmler, izleyicinin deneyime katılmasını ve filmde ortaya çıkan duyguları paylaşmasına yardımcı olmak için film tekniklerini kullanır. Bu filmde kullanılan film teknikleri, karakterler arasındaki ilişkiyi anlamlandırmaya ve anlam vermeye yardımcı olur. Ancak, bu film teknikleri sadece karakterler arasındaki ilişkiyi vurgulamakla kalmaz, aynı zamanda şiir, carpe diem (günü yakala), okul gibi filmin temalarıyla olan ilişkisini de vurgular."},
{"question_id": 85,"text": "Lütfen verilen yer hakkındaki düşüncelerinizi ve neden ziyaret edilmesi gerektiğini düşündüğünüzü belirtin.\nGirdi: Barselona, İspanya","task": "Self_Instruct","answer": "Dünyada Barselona gibi bir yer yoktur. Gotik Mahalle'de gezinerek geçirilen günlerden plajda geçirilen öğleden sonralara ve sabaha kadar süren partilere kadar şehir, manyetik bir çekime sahiptir. Tapas ve hareketli pazarlar rehber kitaplarda hak ettikleri ilgiyi alırken, Barselona'nın gerçek taç mücevheri Antoni Gaudí'nin eserleridir. Onun ikonik yaratımları, baş döndürücü Basilica of La Sagrada Familia gibi, anında tanınabilir ve milyonlarca seyahat hayalini beslemiştir. Buradaki tek turist siz olmayacaksınız (özellikle yaz aylarında), ancak kalabalığın arasında bile yılın herhangi bir zamanında kendi Akdeniz büyünüzü bulacaksınız."},
  
{"question_id": 86,"text": "Verilen şehri ziyaret etmek için yılın en iyi zamanını düşünün ve bu zamanı seçme nedenlerinizi belirtin.\nGirdi: Sydney, Avustralya","task": "Self_Instruct","answer": "Mart ile Mayıs arası: Sydney'i ziyaret etmek için en iyi zamanlar Mart-Mayıs ve Eylül-Kasım ayları arasındadır. Daha rahat sıcaklıklar ve daha az kalabalık bulacaksınız bu da muhtemelen uçak biletlerinde daha iyi fiyatlar bulma olasılığınızın artacağı anlamına gelir.\nAncak kıştan kaçmak ve kalabalıklarla birlikte ısınmak istiyorsanız, ocak ayında günlük ortalama sıcaklıklar 30°C/86°F'ye kadar çıkabilir ve yaklaşık 20°C/67°F’ye düşebilir.”},
{"question_id": 87,"text": "Otel misafirlerine otel yorumları yazmaları için yardımcı olacak bir anket hazırlayın.","task": "Self_Instruct", "answer": "1- Bu tesis hakkındaki genel değerlendirmeniz:\n2- Değerlendirmenizin başlığı:\n3- Ziyaretinizi özetleyin veya ilginç bir ayrıntıyı vurgulayın:\n4- Değerlendirmeniz:\n5- Bu ne tür bir seyahatti? İş/Çiftler/Aile/Arkadaşlar/Yalnız\n6- Ne zaman seyahat ettiniz?\n7- Biraz daha bilgi verebilir misiniz? (isteğe bağlı)\nGörüşlerinizi almak isteriz! Paylaşabileceğiniz her şey, diğer gezginlerin mükemmel otellerini seçmelerine yardımcı olacaktır. Teşekkürler.\nOtel Tarzı ve İmkanları:\nBu otelde çamaşırhane hizmeti var mı? Evet/Hayır/Emin Değilim\nBu otelde oyun odası var mı? Evet/Hayır/Emin Değilim\nBu otelde güneşlenme terası var mı? Evet/Hayır/Emin Değilim\nOtelin resepsiyonu 24 saat hizmet veriyor mu? Evet/Hayır/Emin Değilim\n8- Bu otel ne kadar pahalı? Bütçe/Orta sınıf/Lüks\n9- İyi bir oda seçmelerine yardımcı olmak için gezginlere bir ipucu ekleyin (ör. en iyi manzaralar, daha sessiz katlar, erişilebilirlik vb.)\n10- Paylaşacak fotoğraflarınız var mı? (isteğe bağlı)"},
{"question_id": 88, "text": "Belirtilen zamanda ABD'de ziyaret edilecek en popüler yerlerin bir listesini yapın.\nGirdi: Kasım","task": "Self_Instruct","answer": "1- Ilıman hava ve yerel içkiler için: San Diego\n2- Sonbahar yapraklarının son gösterisi için: Manchester, VT\n3- Beklenmedik sanat ve dağ manzaraları için: Las Vegas\n4- Buz pateni ve aile eğlencesi için: Chicago\n5- Sahil kenarında Şükran Günü deneyimi için: Key West, FL\n6- Harika yemekler ve hayalet turları için: Savannah, GA"}, 
{"question_id": 89,"text": "Fransa'da kaçırılmaması gereken en popüler şehirleri söyleyin. Her yerin en iyi yönlerini de ekleyin.", "task": "Self_Instruct","answer": "1- Paris, En iyi: Tarihi yerler ve romantik atmosfer\n2- Nice, En iyi: Mimari ve yemek\n3- Lyon, En iyi: Yemek ve canlı müzik\n4- Bordeaux, En iyi: Şarap ve antikalar\n5- Marsilya, En iyi: Müzeler ve gece hayatı\n6- Strazburg, En iyi: Tarihi mimari ve yemek"},  
{"question_id": 90, "text": "Aşağıdaki soruyu cevaplayın.\nGirdi: Java'da stringleri nasıl karşılaştırırım?\nŞu ana kadar programımda tüm stringleri karşılaştırmak için == operatörünü kullandım. Ancak bir hata ile karşılaştım, bunlardan birini .equals() ile değiştirdim ve hata düzeldi.\n== kötü mü? Ne zaman kullanılmalı ve kullanılmamalı? Fark nedir?","task": "Self_Instruct","answer": "== referans eşitliğini test eder (aynı nesne olup olmadıklarını).\n.equals() değer eşitliğini test eder (mantıksal olarak \"eşit\" olup olmadıklarını).\nObjects.equals() null kontrolü yaparak .equals() çağırır, böylece bunu yapmanıza gerek kalmaz (JDK7'den itibaren mevcuttur, ayrıca Guava'da da mevcuttur).\nSonuç olarak, iki stringin aynı değere sahip olup olmadığını test etmek istiyorsanız, muhtemelen Objects.equals() kullanmak isteyeceksiniz.\nNadiren interned stringlerle çalıştığınızı bildiğiniz durumlarda == kullanabilirsiniz."},
  
{"question_id": 91,"text": "Size bir soru ve iki olası cevap veriliyor. Göreviniz her bir cevabı değerlendirmek ve doğru olup olmadığını belirlemektir. Yanlışsa, nedenini açıklayın.\nGirdi: Kullanıcı girdisinden tek bir karakter okumanın bir yolu var mı? Örneğin, terminalde bir tuşa basılır ve bu geri döndürülüyor (getch() gibi). Windows'da bunun için bir işlev olduğunu biliyorum ancak platformlar arası bir şey istiyorum.\nCevap 1: İşte Windows, Linux ve OSX'te tek bir karakteri nasıl okuyabileceğinizi anlatan ActiveState Recipes sitesine bir bağlantı:\nhttps://code.activestate.com/recipes/134892/\nCevap 2: Sonucu terminalde görebilmek için sadece ekranı tutmak istiyorsanız, kodun sonuna `Girdi()` yazın ve ekranı tutacaktır.","task": "Self_Instruct","answer": "Cevap 1 doğrudur.\nCevap 2 yanlıştır çünkü soruya cevap vermez. Kullanıcı, tek bir karakterin nasıl okunacağını sormaktadır."},  
{"question_id": 92, "text": "Size iki soru verildi. İki sorunun birbirinin kopyası olup olmadığını kontrol edin.\nGirdi: Soru1: Multiprocessing'in threading'e göre avantajlarını anlamaya çalışıyorum. Global Interpreter Lock'u aşmanın bir yolu olduğunu biliyorum ancak başka ne gibi avantajları var ve threading aynı şeyi yapamaz mı?\nSoru2: Python'da belirli işlemleri paralel olarak çalıştırmak ve kodumu hızlandırmak için threading ve multiprocessing modüllerini kullanmayı öğreniyorum.\nThreading.Thread() nesnesi ile multiprocessing.Process() arasındaki farkı anlamakta zorlanıyorum (belki de bu konuda teorik bir bilgi geçmişim olmadığı içindir.) \nAyrıca, bir iş kuyruğu oluşturup, yalnızca 4 (örneğin) tanesini aynı anda çalıştırırken, diğerlerinin kaynakların serbest kalmasını beklemesi gerektiğinde nasıl yapılacağı konusu da benim için tam olarak açık değil.\nBelgelerdeki örnekleri açık buluyorum ancak işleri biraz karmaşıklaştırmaya çalıştığımda, birçok garip hatayla karşılaşıyorum (örneğin, bir yöntemin pickle yapılamaması gibi).\nYani, threading ve multiprocessing modüllerini ne zaman kullanmalıyım?\nBu iki modülün arkasındaki kavramları ve karmaşık görevler için nasıl kullanılacağını açıklayan bazı kaynaklar önerebilir misiniz?","task": "Self_Instruct","answer": "Evet, kopyalar."},
{"question_id": 93,"text": "Size verilen konuyla ilgili bir programlama problemi tasarlayın. Sorunuzu örnekler ve kısıtlamalar ekleyerek geliştirin.\nGirdi: Dinamik Programlama","task": "Self_Instruct", "answer": "Bir tamsayı dizisi (nums) verildiğinde, kesinlikle artan en uzun alt dizinin uzunluğunu çıktı olarak verir.\n\n Örnek 1:\nGirdii: nums = [10,9,2,5,3,7,101,18]\nÇıktı: 4\nAçıklama: En uzun artan alt dizi [2,3,7,101]'dir, bu nedenle uzunluk 4'tür.\n\nÖrnek 2:\nGirdi: nums = [0,1,0,3,2,3]\nÇıktı: 4\n\nÖrnek 3:\nGirdi: nums = [7,7,7,7,7,7,7]\nÇıktı: 1\n \nKısıtlamalar:\n1 <= nums.length <= 2500\n-104 <= nums[i] <= 104\n \nEkstra: O(n log(n)) zaman karmaşıklığında çalışan bir algoritma bulabilir misiniz?"},
{"question_id": 94,"text": "Aşağıdaki probleme bir Java çözümü sağlayın.\nGirdi: Verilen bir tamsayı n, eğer bir üç kuvveti ise true verir. Aksi takdirde false verir.\nBir tamsayı n, eğer n == 3^x olacak şekilde bir tamsayı x varsa, bir üç kuvvetidir.\n\nÖrnek 1:\nGirdi: n = 27\nÇıktı: true\nAçıklama: 27 = 3^3\n\nÖrnek 2:\nGirdi: n = 0\nÇıktı: false\nAçıklama: 3^x = 0 olan hiçbir x yoktur.\n\nÖrnek 3:\nGirdi: n = -1\nÇıktı: false\nAçıklama: 3^x = (-1) olan hiçbir x yoktur.\n \nKısıtlamalar:\n-231 <= n <= 231 - 1\nEkstra: Döngüler/özyineleme olmadan çözebilir misiniz?","task": "Self_Instruct","answer": "public class Solution {\n\tpublic boolean isPowerOfThree(int n) {\n \t\treturn (Math.log10(n) / Math.log10(3)) % 1 == 0;\n\t}\n}"},
  
{"question_id": 95, "text": "Bilgisayar bilimlerinde bir iş için klasik mülakat sorularında en yaygın olan konuları düşünün.", "task": "Self_Instruct","answer": "+ Dizi\n+ Dizgiler\n+ Bağlı Liste\n+ Ağaçlar\n+ Sıralama ve Arama\n+ Dinamik Programlama\n+ Tasarım\n+ Matematik"},  
{"question_id": 96, "text": "Bu kişiye mülakat için tanımladığı  senaryo boyunca rehberlik etmeniz gerekecek.\nGirdi: Nihayet! Bir süre karanlıkta atış yaptıktan ve beyaz tahtada örnek girdilerle telaşlı bir şekilde uğraştıktan sonra, mülakatçınızın size verdiği kodlama sorusunu çözmek için bir algoritma buldunuz.\nOh. Önünüzde artık net bir yol olduğu için çok rahatladım. Artık çırpınmıyorsunuz.\nŞimdi çözümünüzü kodlamaya hazırlanıyorsunuz.\nBirden, mülakatçınız size ters köşe yapıyor.\n\"Peki ya problemi şu şekilde düşünseydik?\"\nKodlama mülakatı sırasında hepimizin hissettiği bir gerginlik hissediyorsunuz:\n\"Ne söylediklerini dinlemeye çalışın... ama düşünce treninizi kaybetmeyin... ah, ikisini birden yapamam!\"","task": "Self_Instruct","answer": "Mülakatçınız muhtemelen başlangıçta yanlış yola girmenizden sizi sorumlu tutmayacaktır. Gerçekten zeki mühendislerin de aynı şeyi yaptığını görmüşlerdir. Bunun nedeninin labirenti sadece kısmen görebilmeniz olduğunu anlarlar.\nSizi bir süre yanlış yolda bırakmış olabilirler, çünkü düşüncelerinizi yardımsız bir şekilde organize edip edemeyeceğinizi görmek istemişlerdir. Ancak şimdi, yanlış çıkmazı bulup geri dönme kısmını hızlı bir şekilde geçmenizi istiyorlar. Bunun nedeni, bunu kendiniz halledebileceğinize inanmadıkları değil. Ancak soruyu bitirmek için yeterli zamanınızın olduğundan emin olmak istiyorlar.\nAncak sizi eleştirecekleri bir şey var: onları dinlememek. Kimse, dinlemeyen bir mühendisle çalışmak istemez.\nBu nedenle, kodlama görüşmesi sırasında, düşünce treninizi sürdürmek ile mülakatçınızın önerdiği fikri düşünmek arasında kaldığınızda...şunu unutmayın:\nMülakatçınızı dinlemek en önemli şeydir.\nNe söylediklerini alıp onunla devam edin. Söylediklerinden sonra gelen adımları düşünün.\nBu, bulunduğunuz yolu tamamen terk etmek anlamına gelse bile. Mülakatçınızın sizi yönlendirdiği rotaya güvenin.\nÇünkü onlar labirentin tamamını görebiliyorlar."},  
{"question_id": 97,"text": "Size bir programlama problemi ve uygulaması verildi. Problemi ve uygulamasını analiz edin ve sorunu çözmek için kullanılan algoritma ve yaklaşımı açıklayın.\nGirdi: Tablo: Kişi\n| Sütun Adı | Tür |\n| kişiId | int |\n| sonİsim | varchar |\n| ilkİsim | varchar |\npersonId bu tablonun birincil anahtarıdır.\nBu tablo, bazı kişilerin kimlikleri ve adları hakkında bilgi içerir.\nTablo: Address\n| Sütun Adı | Tür |\n| addressId | int |\n| personId | int |\n| city | varchar |\n| state | varchar |\naddressId bu tablonun birincil anahtarıdır.\nBu tablonun her satırı, kimlik numarası = PersonId olan bir kişinin şehir ve eyalet bilgilerini içerir.\nPerson tablosundaki her kişinin adı, soyadı, şehir ve eyaletini raporlamak için bir SQL sorgusu yazın. Bir personId'nin adresi Address tablosunda yoksa, null raporlayın.\nSonuç tablosunu herhangi bir sırayla döndürün.\nUygulama:\nselect FirstName, LastName, City, State\nfrom Person left join Address\non Person.PersonId = Address.PersonId\n;","task": "Self_Instruct",
"answer": "Address tablosundaki PersonId, Person tablosunun yabancı anahtarı olduğundan, bu iki tabloyu bir kişinin adres bilgilerini almak için birleştirebiliriz.\nHer kişi için adres bilgileri bulunmayabileceğini göz önünde bulundurarak, varsayılan iç birleştirme yerine dış birleştirme kullanmalıyız."},  
{"question_id": 98,"text": "Verilen makaleyi bilimsel hatalar açısından kontrol edin ve gerekirse düzeltin.\nGirdi: Çinko, sağlık için gerekli olan bir mineraldir. Vücuttaki birçok biyokimyasal süreçte yer alır ve bağışıklık sisteminin düzgün çalışması için gereklidir. Fazla çinko zararlı değildir çünkü idrarla atılır.","task": "Self_Instruct","answer": "Çinko, iyi sağlık için temel bir gereklilik olsa da, aşırı çinko zararlı olabilir. Aşırı çinko emilimi, bakır ve demir emilimini baskılar. Serbest çinko iyonu çözeltide bitkiler, omurgasızlar ve hatta omurgalı balıklar için son derece zehirlidir. Serbest İyon Aktivite Modeli, literatürde iyi belgelenmiştir ve yalnızca mikromolar miktarlarda serbest iyonun bazı organizmaları öldürdüğünü göstermektedir. Yakın tarihli bir örnek, suda tüm Daphnia'nın %93'ünü öldürdüğünü göstermiştir.\nSerbest çinko iyonu, güçlü bir Lewis asidi olup aşındırıcı hale gelir. Mide asidi, içinde metalik çinkonun kolayca çözündüğü hidroklorik asit içerir ve aşındırıcı çinko klorür oluşturur. 1982 sonrası Amerikan bir sent parçasını (yüzde 97.5 çinko) yutmak, çinko iyonunun asidik midede yüksek çözünürlüğü nedeniyle mide zarına zarar verebilir."}, 
{"question_id": 99,"text ": "Size verilen makaleyi kısaca özetleyin.\nGirdi: Matematik ve sanat çeşitli şekillerde ilişkilidir. Matematik, güzellik tarafından motive edilen bir sanat olarak tanımlanmıştır. Matematik, müzik, dans, resim, mimari, heykel ve tekstil gibi sanat dallarında fark edilebilir. Ancak bu makale, görsel sanatlardan matematiğe odaklanmaktadır.\nMatematik ve sanat uzun bir tarihsel ilişkiye sahiptir. Sanatçılar, Yunan heykeltıraş Polykleitos'un ideal erkek çıplağı için 1:√2 oranına dayandığı tahmin edilen Kanon'unu yazdığı M.Ö. 4. yüzyıldan beri matematiği kullanmışlardır. Antik sanatta ve mimaride altın oran kullanımına dair kalıcı popüler iddialar, güvenilir kanıtlar olmadan yapılmıştır. İtalyan Rönesansı'nda, Luca Pacioli, Leonardo da Vinci'nin ahşap baskılarla süslediği altın oranın sanatta kullanımına dair etkili risalesi De divina proportione'yi (1509) yazmıştır. Başka bir İtalyan ressam, Piero della Francesca, Euclid'in perspektif hakkındaki fikirlerini De Prospectiva Pingendi gibi risalelerde ve tablolarında geliştirmiştir. Gravürcü Albrecht Dürer, Melencolia I adlı eserinde matematiğe birçok atıfta bulunmuştur. Modern zamanlarda, grafik sanatçısı M. C. Escher, matematikçi H. S. M. Coxeter'in yardımıyla yoğun bir şekilde döşeme ve hiperbolik geometri kullanmıştır, De Stijl hareketi ise Theo van Doesburg ve Piet Mondrian tarafından açıkça geometrik formları benimsemiştir. Matematik, yorgan yapımı, örgü, çapraz dikiş, tığ işi, nakış, dokuma, Türk ve diğer halı yapımı gibi tekstil sanatlarına ilham vermiştir. İslam sanatında, simetriler, Farsça girih ve Fas zellige karo işleri, Babür jali delikli taş ekranlar ve yaygın muqarnas tonozlar gibi çeşitli formlarda belirgindir.","task": "Self_Instruct","answer": "Bu makale, matematik ve sanat arasındaki ilişkiyi, görsel sanatlara odaklanarak tartışmaktadır. Sanatçıların antik dönemden beri matematiği nasıl kullandığını ve matematiğin çeşitli tekstil sanatlarına nasıl ilham verdiğini anlatmaktadır."},
{"question_id": 100,"text": ""Makaleyi daha bilgilendirici hale getirmek için konu hakkındaki bilginizi kullanarak geliştirin.\nGirdi: \"Adil ticaret\" hareketi, \"ticaret adaleti\" hareketi olarak da bilinir, emek, çevre ve sosyal standartların kullanılmasını teşvik eder ve özellikle Üçüncü ve İkinci Dünyalardan Birinci Dünyaya ihraç edilen ürünlerin üretiminde bu standartların uygulanmasını savunur. Bu tür fikirler, ticaretin kendisinin bir insan hakkı olarak kodlanması gerekip gerekmediğine dair bir tartışmayı da ateşlemiştir.","task": "Self_Instruct","answer": "\"Adil ticaret\" hareketi, \"ticaret adaleti\" hareketi olarak da bilinir, emek, çevre ve sosyal standartların kullanılmasını teşvik eder ve özellikle Üçüncü ve İkinci Dünyalardan Birinci Dünyaya ihraç edilen ürünlerin üretiminde bu standartların uygulanmasını savunur. Bu tür fikirler, ticaretin kendisinin bir insan hakkı olarak kodlanması gerekip gerekmediğine dair bir tartışmayı da ateşlemiştir.\nİthalatçı firmalar gönüllü olarak adil ticaret standartlarına uyar veya hükümetler bunları istihdam ve ticaret yasalarının bir kombinasyonu aracılığıyla zorlayabilirler. Önerilen ve uygulanan adil ticaret politikaları, köle emeği kullanılarak üretilen malların yasaklanması gibi yaygın olanlardan, 1980'lerde kahve için uygulanan asgari fiyat destekleme programlarına kadar büyük ölçüde değişiklik gösterir. Sivil toplum kuruluşları, etiketleme gereksinimlerine uyumun bağımsız denetçileri olarak hizmet ederek adil ticaret standartlarını teşvik etmede de rol oynar. Bu anlamda, bir tür Korumacılıktır."}
